In [2]:
import pandas as pd

In [26]:
df = pd.read_csv(r"d:\IMP FILES\Practice files\cleaning\duplicate_null_data.csv")
df

   ID    Name   Age Department   Salary
0   1    John  25.0         HR  50000.0
1   2    Emma  30.0    Finance  60000.0
2   3    Liam   NaN        NaN  55000.0
3   4     NaN  22.0         IT  48000.0
4   5  Sophia  29.0  Marketing      NaN
5   3    Liam   NaN    Finance  55000.0
6   2    Emma  30.0        NaN  60000.0

In [4]:
df = df.drop_duplicates(subset=['Name'], keep='first')
df

   ID    Name   Age Department   Salary
0   1    John  25.0         HR  50000.0
1   2    Emma  30.0    Finance  60000.0
2   3    Liam   NaN        NaN  55000.0
3   4     NaN  22.0         IT  48000.0
4   5  Sophia  29.0  Marketing      NaN

In [5]:
df = df.drop(columns = ['Age'])
df

   ID    Name Department   Salary
0   1    John         HR  50000.0
1   2    Emma    Finance  60000.0
2   3    Liam        NaN  55000.0
3   4     NaN         IT  48000.0
4   5  Sophia  Marketing      NaN

In [6]:
df = df.fillna('No input')
df

   ID      Name Department    Salary
0   1      John         HR   50000.0
1   2      Emma    Finance   60000.0
2   3      Liam   No input   55000.0
3   4  No input         IT   48000.0
4   5    Sophia  Marketing  No input

In [10]:
df

   ID      Name Department
0   1      John         HR
1   2      Emma    Finance
2   3      Liam   No input
3   4  No input         IT
4   5    Sophia  Marketing

In [13]:
df['Salary'] = [50000, 60000, 55000, 48000, 'no input']  
df

   ID      Name Department    Salary
0   1      John         HR     50000
1   2      Emma    Finance     60000
2   3      Liam   No input     55000
3   4  No input         IT     48000
4   5    Sophia  Marketing  no input